import pandas as pd

data = {
    'Имя': ['Алексей', 'Мария', 'Дмитрий', 'Екатерина', 'Сергей',
            'Анна', 'Иван', 'Ольга', 'Павел', 'Татьяна'],
    'Математика': [4, 5, 3, 4, 5, 2, 4, 3, 5, 4],
    'Физика': [5, 4, 3, 4, 5, 3, 4, 2, 4, 5],
    'Химия': [4, 5, 4, 3, 5, 4, 3, 5, 4, 3],
    'История': [3, 4, 5, 2, 4, 5, 4, 3, 5, 4],
    'Литература': [5, 4, 3, 5, 4, 3, 5, 4, 3, 5]
}

df = pd.DataFrame(data) # Создаем DataFrame из словаря
print(df.tail())

average_scores = df.iloc[:, 1:].mean()
median_scores = df.iloc[:, 1:].median()

print(f"Средние оценки по предметам:\n{average_scores}")
print(f"Медианные оценки по предметам:\n{median_scores}")

Q1_math = df['Математика'].quantile(0.25)
Q3_math = df['Математика'].quantile(0.75)

IQR_math = Q3_math - Q1_math

print(f"Математика Q1 {Q1_math}, Q3 {Q3_math}, IQR = Q3 - Q1 = {IQR_math} \n Эти значения показывают, что 25% учеников имеют оценку по математике 3 или ниже, 75% учеников имеют оценку 4 или ниже, и разница между 75-м и 25-м процентилями составляет 1, балла.")